In [10]:
# postgres://mjnojvya:q2c92SeoG45Oe7Np9GjdMB2Z2Ijuu10o@rain.db.elephantsql.com/mjnojvya

In [11]:
import psycopg2
import pandas as pd

In [12]:
db_params = {
    "host": "arjuna.db.elephantsql.com",
    "database": "hvfunzhl",
    "user": "hvfunzhl",
    "password": "Rfc9Qacy89gxakiFcEvSyEqi-Mdw5p51",
    "port": "5432"
}

connection = psycopg2.connect(**db_params)

In [13]:
employee_query= """select employee_id,(first_name||' '||last_name) as full_name,city,region,country,reports_to from employees"""
employee = pd.read_sql_query(employee_query,connection)

C:\Users\saini\AppData\Local\Temp\ipykernel_15744\2955271795.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employee = pd.read_sql_query(employee_query,connection)

In [14]:
employee

   employee_id         full_name      city region country  reports_to
0            1     Nancy Davolio   Seattle     WA     USA         2.0
1            2     Andrew Fuller    Tacoma     WA     USA         NaN
2            3   Janet Leverling  Kirkland     WA     USA         2.0
3            4  Margaret Peacock   Redmond     WA     USA         2.0
4            5   Steven Buchanan    London   None      UK         2.0
5            6    Michael Suyama    London   None      UK         5.0
6            7       Robert King    London   None      UK         5.0
7            8    Laura Callahan   Seattle     WA     USA         2.0
8            9    Anne Dodsworth    London   None      UK         5.0

In [15]:
manager_query = """select employee_id,(first_name||' '||last_name) as manager from employees"""
manager = pd.read_sql_query(manager_query,connection)

C:\Users\saini\AppData\Local\Temp\ipykernel_15744\3750160905.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  manager = pd.read_sql_query(manager_query,connection)

In [16]:
employee = pd.merge(employee,manager,left_on='reports_to',right_on='employee_id',how='left')

In [17]:
employee

,employee_id_x,full_name,city,region,country,reports_to,employee_id_y,manager
0,1,Nancy Davolio,Seattle,WA,USA,2.0,2.0,Andrew Fuller
1,2,Andrew Fuller,Tacoma,WA,USA,NaN,NaN,NaN
2,3,Janet Leverling,Kirkland,WA,USA,2.0,2.0,Andrew Fuller
3,4,Margaret Peacock,Redmond,WA,USA,2.0,2.0,Andrew Fuller
4,5,Steven Buchanan,London,None,UK,2.0,2.0,Andrew Fuller
5,6,Michael Suyama,London,None,UK,5.0,5.0,Steven Buchanan
6,7,Robert King,London,None,UK,5.0,5.0,Steven Buchanan
7,8,Laura Callahan,Seattle,WA,USA,2.0,2.0,Andrew Fuller
8,9,Anne Dodsworth,London,None,UK,5.0,5.0,Steven Buchanan

In [18]:
from sqlalchemy import create_engine

In [19]:
connection_string="postgresql://mjnojvya:q2c92SeoG45Oe7Np9GjdMB2Z2Ijuu10o@rain.db.elephantsql.com/mjnojvya"
engine = create_engine(connection_string)

In [20]:
employee.to_sql('employee_temp',engine,if_exists='replace')

9

In [21]:
order_details_query = """
select order_date,
employee_id,
sum(unit_price*quantity) as total_sale_amt,
sum(quantity) as quantity,
count(customer_id) as number_of_customers
from order_details
join orders on orders.order_id=order_details.order_id
group by
order_date,
employee_id
order by
order_date
"""
order_master= pd.read_sql_query(order_details_query,connection)

data=pd.read_sql(order_details_query,connection)
data.to_csv('export.csv')

C:\Users\saini\AppData\Local\Temp\ipykernel_15744\3583559713.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_master= pd.read_sql_query(order_details_query,connection)
C:\Users\saini\AppData\Local\Temp\ipykernel_15744\3583559713.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql(order_details_query,connection)

In [22]:
order_master

     order_date  employee_id  total_sale_amt  quantity  number_of_customers
0    1996-07-04            5      439.999998        27                    3
1    1996-07-05            6     1863.400064        49                    2
2    1996-07-08            4     1813.000040        60                    3
3    1996-07-08            3      670.799986        41                    3
4    1996-07-09            4     3730.000153       105                    3
..          ...          ...             ...       ...                  ...
763  1998-05-05            4     5217.999985       200                    4
764  1998-05-06            1     1374.600000        72                   25
765  1998-05-06            8      586.000000        42                    3
766  1998-05-06            7      244.300011        14                    1
767  1998-05-06            4     1056.999998        50                    3

[768 rows x 5 columns]

In [23]:
employee = employee[['employee_id_x', 'full_name', 'city', 'region', 'country','manager']]

In [24]:
order_master = pd.merge(order_master,employee,left_on='employee_id',right_on='employee_id_x',how='left')

In [25]:
order_master.columns

Index(['order_date', 'employee_id', 'total_sale_amt', 'quantity',
       'number_of_customers', 'employee_id_x', 'full_name', 'city', 'region',
       'country', 'manager'],
      dtype='object')

In [26]:
order_master = order_master[['order_date', 'employee_id','full_name', 'city', 'region', 'country', 'manager','total_sale_amt', 'quantity','number_of_customers']]

In [27]:
order_master

,order_date,employee_id,full_name,city,region,country,manager,total_sale_amt,quantity,number_of_customers
0,1996-07-04,5,Steven Buchanan,London,None,UK,Andrew Fuller,439.999998,27,3
1,1996-07-05,6,Michael Suyama,London,None,UK,Steven Buchanan,1863.400064,49,2
2,1996-07-08,4,Margaret Peacock,Redmond,WA,USA,Andrew Fuller,1813.000040,60,3
3,1996-07-08,3,Janet Leverling,Kirkland,WA,USA,Andrew Fuller,670.799986,41,3
4,1996-07-09,4,Margaret Peacock,Redmond,WA,USA,Andrew Fuller,3730.000153,105,3
...,...,...,...,...,...,...,...,...,...,...
763,1998-05-05,4,Margaret Peacock,Redmond,WA,USA,Andrew Fuller,5217.999985,200,4
764,1998-05-06,1,Nancy Davolio,Seattle,WA,USA,Andrew Fuller,1374.600000,72,25
765,1998-05-06,8,Laura Callahan,Seattle,WA,USA,Andrew Fuller,586.000000,42,3
766,1998-05-06,7,Robert King,London,None,UK,Steven Buchanan,244.300011,14,1
767,1998-05-06,4,Margaret Peacock,Redmond,WA,USA,Andrew Fuller,1056.999998,50,3

In [28]:
order_master.to_sql('employee_performace',engine,if_exists='replace')

768

In [29]:
import pandas as pd
import gspread
from gspread_dataframe import set_with_dataframe
from google.oauth2.service_account import Credentials
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
scopes = ['https://www.googleapis.com/auth/spreadsheets',
          'https://www.googleapis.com/auth/drive']

credentials = Credentials.from_service_account_file('C:\\Users\\saini\\Downloads\\deworkshop-413804-aed0d6039c87.json', scopes=scopes)

gc = gspread.authorize(credentials)

gauth = GoogleAuth()
drive = GoogleDrive(gauth)

# open a google sheet
gs = gc.open_by_key('1TlmJn85yFRWNx6b2JT9NEcNRZpD-5K7XzBe0a6QwxNI')
# select a work sheet from its name
worksheet1 = gs.worksheet('Sheet1')

In [30]:
worksheet1.clear()
set_with_dataframe(worksheet=worksheet1, dataframe=order_master, include_index=False,include_column_header=True, resize=True)